public interface RestActions{

    /* Нулевой запрос */
    int AUTH = 0; // Авторизация пользователя

    /* Запросы, для аыполнения которых не требуется авторизация */
    int TECH_SUPPORT = 1; // Написать письмо в тех. поддержку
    int FEEEDBACK = 2; // Обратная связь
    int ADD_REVIEW_UNAUTHORIZED = 3; // Добавить отзыв - применимо только для неавторизованных посетителей
    int LIST_ALL_REVIEWS = 4; // Просмотреть список всех пользователей

    int PASSWORD_REMINDER_REQUEST = 5; // Запросить получение письма, при помощи которого можно восстановить пароль
    int PASSWORD_REMINDER = 6; // Восстановить пароль

    /* Запросы, для выполнения которых требуется авторизация, но не требуются права администратора */
    int ADD_REVIEW_AUTHORIZED = 101; // Добавить отзыв - применимо только для авторизованны пользователем

    int GET_POLITICIAN_LIST = 102; // Вывести всю информацию о политиках, просмотр информации о которых разрешён
    // Администратором того или иного пользователя.
    int GET_POLITICIAN_INFO = 103; // Вывести информацию о конкретном политике

    int SET_CURRENT_USER_INFO = 104; // Изменить информацию о себе


    /* Запросы, для выполнения которых требуется как авторизация, так и права администратора */
    int ADD_USER = 201; // Добавить нового пользователя
    int REMOVE_USER = 202; // Удалить пользователя. Можно удалить только того пользователя, который создал данный
    // администратор. Удаление root'а невозможно
    int GET_USER_LIST = 203; // Вывести список некоторых пользователей (тех, кого надо)
    int GET_USER_INFO = 204; // Вывести всю информацию о том или ином пользователе
    int SET_USER_INFO = 205; // Изменить информацию о том или ином пользователе, в том числе и сменить пароль
    // Обратите внимание, что пользователи могут сменить пароль только самих себя, в то время как администраторы
    // могут сменить пароль только тех пользователей, которые были добавлены этими администраторами. Изменение root'а
    // невозможно

    int ADD_POLITICIAN = 206; // Добавить политика в базу данных. Этого политика могут увидеть только те пользователи,
    // которых создал администратор. Программа также осуществляет контроль платного/бесплатного
    int REMOVE_POLITICIAN = 207; // Удалить политика из базы данных. Можно удалить только того политика, который создал
    // данный администратор, либо пользователь, им созданный
    int SET_POLITICIAN_INFO = 208; // Изменить информацию о политике

    int GET_SITE_LIST = 209; // Вывести список всех сайтов, находящихся в обходе
    int ADD_SITE = 210; // Добавить сайт в обход
    int REMOVE_SITE = 211; // Удалить сайт из обхода
    int SET_SITE_INFO = 212; // Добавить информацию о сайте (его URI)
    int GET_SITE_INFO = 213; // Удалить информацию о сайте (включая всю информацию по его обходам)

}